MaJerle/stm32-usart-uart-dma-rx-tx/drivers/STM32C5xx_drivers/hal/stm32c5xx_hal_smbus.h
/** @defgroup SMBUS_Exported_Functions_Group1 Initialization and de-initialization functions
  * @{
  */

/* Initialization and de-initialization functions  ****************************/
hal_status_t HAL_SMBUS_Init(hal_smbus_handle_t *hsmbus, hal_smbus_t instance);
void HAL_SMBUS_DeInit(hal_smbus_handle_t *hsmbus);
/**
  * @}
  */

/** @defgroup SMBUS_Exported_Functions_Group2 Configuration functions
  * @{
  */

/* Global Configuration functions ****************************************************/
hal_status_t HAL_SMBUS_SetConfig(hal_smbus_handle_t *hsmbus, const hal_smbus_config_t *p_config);
void HAL_SMBUS_GetConfig(const hal_smbus_handle_t *hsmbus, hal_smbus_config_t *p_config);
hal_status_t HAL_SMBUS_SetTiming(hal_smbus_handle_t *hsmbus, uint32_t value);
uint32_t HAL_SMBUS_GetTiming(const hal_smbus_handle_t *hsmbus);

/* Filters Configuration functions ****************************************************/
hal_status_t HAL_SMBUS_SetConfigTimeout(hal_smbus_handle_t *hsmbus, const hal_smbus_timeout_config_t *p_config);
void HAL_SMBUS_GetConfigTimeout(const hal_smbus_handle_t *hsmbus, hal_smbus_timeout_config_t *p_config);

hal_status_t HAL_SMBUS_EnableTimeout(hal_smbus_handle_t *hsmbus, const hal_smbus_timeout_t timeout);
hal_status_t HAL_SMBUS_DisableTimeout(hal_smbus_handle_t *hsmbus, const hal_smbus_timeout_t timeout);
hal_smbus_timeout_t HAL_SMBUS_IsEnabledTimeoutA(const hal_smbus_handle_t *hsmbus);
hal_smbus_timeout_t HAL_SMBUS_IsEnabledTimeoutB(const hal_smbus_handle_t *hsmbus);

hal_status_t HAL_SMBUS_EnableAnalogFilter(hal_smbus_handle_t *hsmbus);
hal_status_t HAL_SMBUS_DisableAnalogFilter(hal_smbus_handle_t *hsmbus);
hal_smbus_analog_filter_status_t HAL_SMBUS_IsEnabledAnalogFilter(const hal_smbus_handle_t *hsmbus);
hal_status_t HAL_SMBUS_SetDigitalFilter(hal_smbus_handle_t *hsmbus, uint32_t noise_filtering_in_bus_clk_period);
uint32_t HAL_SMBUS_GetDigitalFilter(const hal_smbus_handle_t *hsmbus);

/* Wakeup from Stop mode(s) */
hal_status_t HAL_SMBUS_SLAVE_EnableWakeUp(hal_smbus_handle_t *hsmbus);
hal_status_t HAL_SMBUS_SLAVE_DisableWakeUp(hal_smbus_handle_t *hsmbus);
hal_smbus_slave_wake_up_status_t HAL_SMBUS_SLAVE_IsEnabledWakeUp(const hal_smbus_handle_t *hsmbus);

/* Fast mode plus driving capability */
hal_status_t HAL_SMBUS_EnableFastModePlus(hal_smbus_handle_t *hsmbus);
hal_status_t HAL_SMBUS_DisableFastModePlus(hal_smbus_handle_t *hsmbus);
hal_smbus_fast_mode_plus_status_t HAL_SMBUS_IsEnabledFastModePlus(const hal_smbus_handle_t *hsmbus);


/* Acknowledge General Call */
hal_status_t HAL_SMBUS_SLAVE_EnableAckGeneralCall(hal_smbus_handle_t *hsmbus);
hal_status_t HAL_SMBUS_SLAVE_DisableAckGeneralCall(hal_smbus_handle_t *hsmbus);
hal_smbus_slave_ack_general_call_status_t HAL_SMBUS_SLAVE_IsEnabledAckGeneralCall(const hal_smbus_handle_t *hsmbus);

/* Packet Error Check */
hal_status_t HAL_SMBUS_EnablePacketErrorCheck(hal_smbus_handle_t *hsmbus);
hal_status_t HAL_SMBUS_DisablePacketErrorCheck(hal_smbus_handle_t *hsmbus);
hal_smbus_pec_status_t HAL_SMBUS_IsEnabledPacketErrorCheck(const hal_smbus_handle_t *hsmbus);

/* Master alert interrupt */
hal_status_t HAL_SMBUS_MASTER_EnableAlertIT(hal_smbus_handle_t *hsmbus);
hal_status_t HAL_SMBUS_MASTER_DisableAlertIT(hal_smbus_handle_t *hsmbus);
hal_smbus_alert_status_t HAL_SMBUS_MASTER_IsEnabledAlertIT(const hal_smbus_handle_t *hsmbus);

/* Own Address 2 */
hal_status_t HAL_SMBUS_SetConfigOwnAddress2(hal_smbus_handle_t *hsmbus, uint32_t addr, hal_smbus_own_addr2_mask_t mask);
void HAL_SMBUS_GetConfigOwnAddress2(const hal_smbus_handle_t *hsmbus, uint32_t *p_addr,
                                    hal_smbus_own_addr2_mask_t *p_mask);
hal_status_t HAL_SMBUS_EnableOwnAddress2(hal_smbus_handle_t *hsmbus);
hal_status_t HAL_SMBUS_DisableOwnAddress2(hal_smbus_handle_t *hsmbus);
hal_smbus_own_addr2_status_t HAL_SMBUS_IsEnabledOwnAddress2(const hal_smbus_handle_t *hsmbus);

/* Callbacks Register/UnRegister functions  ***********************************/
#if defined (USE_HAL_SMBUS_REGISTER_CALLBACKS) && (USE_HAL_SMBUS_REGISTER_CALLBACKS == 1)
hal_status_t HAL_SMBUS_MASTER_RegisterTxCpltCallback(hal_smbus_handle_t *hsmbus, hal_smbus_cb_t p_callback);
hal_status_t HAL_SMBUS_MASTER_RegisterRxCpltCallback(hal_smbus_handle_t *hsmbus, hal_smbus_cb_t p_callback);
hal_status_t HAL_SMBUS_SLAVE_RegisterTxCpltCallback(hal_smbus_handle_t *hsmbus, hal_smbus_cb_t p_callback);
hal_status_t HAL_SMBUS_SLAVE_RegisterRxCpltCallback(hal_smbus_handle_t *hsmbus, hal_smbus_cb_t p_callback);
hal_status_t HAL_SMBUS_SLAVE_RegisterListenCpltCallback(hal_smbus_handle_t *hsmbus, hal_smbus_cb_t p_callback);
hal_status_t HAL_SMBUS_SLAVE_RegisterAddrMatchCallback(hal_smbus_handle_t *hsmbus,              \
                                                       hal_smbus_slave_addr_cb_t p_callback);
hal_status_t HAL_SMBUS_RegisterAbortCpltCallback(hal_smbus_handle_t *hsmbus, hal_smbus_cb_t p_callback);
hal_status_t HAL_SMBUS_RegisterErrorCallback(hal_smbus_handle_t *hsmbus, hal_smbus_cb_t p_callback);
#endif /* USE_HAL_SMBUS_REGISTER_CALLBACKS */

hal_status_t HAL_SMBUS_SetMode(hal_smbus_handle_t *hsmbus, const hal_smbus_mode_t mode);
hal_smbus_mode_t HAL_SMBUS_GetMode(const hal_smbus_handle_t *hsmbus);
/**
  * @}
  */

/** @defgroup SMBUS_Exported_Functions_Group3 Input and Output operation functions
  * @{
  */

/******* Blocking mode: Polling */
hal_status_t HAL_SMBUS_MASTER_PollForSlaveReady(hal_smbus_handle_t *hsmbus, uint32_t device_addr, uint32_t timeout_ms);

/******* Non-Blocking mode: Interrupt */
hal_status_t HAL_SMBUS_MASTER_SEQ_Transmit_IT(hal_smbus_handle_t *hsmbus, uint32_t device_addr, const void *p_data,
                                              uint32_t size_byte, hal_smbus_xfer_opt_t xfer_opt);
hal_status_t HAL_SMBUS_MASTER_SEQ_Receive_IT(hal_smbus_handle_t *hsmbus, uint32_t device_addr, void *p_data,
                                             uint32_t size_byte, hal_smbus_xfer_opt_t xfer_opt);
hal_status_t HAL_SMBUS_MASTER_Abort_IT(hal_smbus_handle_t *hsmbus, uint32_t device_addr);
hal_status_t HAL_SMBUS_SLAVE_Abort_IT(hal_smbus_handle_t *hsmbus);
hal_status_t HAL_SMBUS_SLAVE_SEQ_Transmit_IT(hal_smbus_handle_t *hsmbus, const void *p_data, uint32_t size_byte,
                                             hal_smbus_xfer_opt_t xfer_opt);
hal_status_t HAL_SMBUS_SLAVE_SEQ_Receive_IT(hal_smbus_handle_t *hsmbus, void *p_data, uint32_t size_byte,
                                            hal_smbus_xfer_opt_t xfer_opt);

