MaJerle/stm32-usart-uart-dma-rx-tx/drivers/STM32C5xx_drivers/hal/stm32c5xx_hal_smbus.h
/* Slave listen interrupt */
hal_status_t HAL_SMBUS_SLAVE_EnableListen_IT(hal_smbus_handle_t *hsmbus);
hal_status_t HAL_SMBUS_SLAVE_DisableListen_IT(hal_smbus_handle_t *hsmbus);

/**
  * @}
  */

/** @defgroup SMBUS_Exported_Functions_Group4 IRQ Handlers
  * @{
  */
/******* SMBUS IRQHandler and Callbacks used in non blocking modes (Interrupt) */
void HAL_SMBUS_EV_IRQHandler(hal_smbus_handle_t *hsmbus);
void HAL_SMBUS_ERR_IRQHandler(hal_smbus_handle_t *hsmbus);

/**
  * @}
  */
/** @defgroup SMBUS_Exported_Functions_Group5 Weak Callback Functions
  * @{
  */
void HAL_SMBUS_MASTER_TxCpltCallback(hal_smbus_handle_t *hsmbus);
void HAL_SMBUS_MASTER_RxCpltCallback(hal_smbus_handle_t *hsmbus);
void HAL_SMBUS_SLAVE_TxCpltCallback(hal_smbus_handle_t *hsmbus);
void HAL_SMBUS_SLAVE_RxCpltCallback(hal_smbus_handle_t *hsmbus);
void HAL_SMBUS_SLAVE_AddrCallback(hal_smbus_handle_t *hsmbus, hal_smbus_slave_xfer_direction_t xfer_direction,
                                  uint32_t addr_match_code);
void HAL_SMBUS_SLAVE_ListenCpltCallback(hal_smbus_handle_t *hsmbus);
void HAL_SMBUS_ErrorCallback(hal_smbus_handle_t *hsmbus);
void HAL_SMBUS_AbortCpltCallback(hal_smbus_handle_t *hsmbus);

/**
  * @}
  */
/** @defgroup SMBUS_Exported_Functions_Group6 Peripheral State, Peripheral Clock Frequency, Mode and Errors functions
  *  @{
  */
/* Peripheral State and Errors functions  **************************************************/
hal_smbus_state_t HAL_SMBUS_GetState(const hal_smbus_handle_t *hsmbus);
#if defined (USE_HAL_SMBUS_GET_LAST_ERRORS) && (USE_HAL_SMBUS_GET_LAST_ERRORS == 1)
uint32_t HAL_SMBUS_GetLastErrorCodes(const hal_smbus_handle_t *hsmbus);
#endif /* USE_HAL_SMBUS_GET_LAST_ERRORS */
uint32_t HAL_SMBUS_GetClockFreq(const hal_smbus_handle_t *hsmbus);
/**
  * @}
  */

#if defined(USE_HAL_MUTEX) && (USE_HAL_MUTEX == 1)
/** @defgroup SMBUS_Exported_Functions_Group7 Acquire/Release/Free the bus
  * @{
  */
hal_status_t HAL_SMBUS_AcquireBus(hal_smbus_handle_t *hsmbus, uint32_t timeout_ms);
hal_status_t HAL_SMBUS_ReleaseBus(hal_smbus_handle_t *hsmbus);
/**
  * @}
  */
#endif /* USE_HAL_MUTEX */

#if defined (USE_HAL_SMBUS_USER_DATA) && (USE_HAL_SMBUS_USER_DATA == 1)
/** @defgroup SMBUS_Exported_Functions_Group8 Set and get user data functions
  * @{
  */
void HAL_SMBUS_SetUserData(hal_smbus_handle_t *hsmbus, const void *p_user_data);
const void *HAL_SMBUS_GetUserData(const hal_smbus_handle_t *hsmbus);
/**
  * @}
  */
#endif /* USE_HAL_SMBUS_USER_DATA */

/**
  * @}
  */

/**
  * @}
  */

#endif /* I2C1 || I2C2 */

/**
  * @}
  */

#ifdef __cplusplus
}
#endif

#endif /* STM32C5XX_HAL_SMBUS_H */
